meta_info_def {
  stripped_op_list {
    op {
      name: "Add"
      input_arg {
        name: "x"
        type_attr: "T"
      }
      input_arg {
        name: "y"
        type_attr: "T"
      }
      output_arg {
        name: "z"
        type_attr: "T"
      }
      attr {
        name: "T"
        type: "type"
        allowed_values {
          list {
            type: DT_HALF
            type: DT_FLOAT
            type: DT_DOUBLE
            type: DT_UINT8
            type: DT_INT8
            type: DT_INT16
            type: DT_INT32
            type: DT_INT64
            type: DT_COMPLEX64
            type: DT_COMPLEX128
            type: DT_STRING
          }
        }
      }
    }
    op {
      name: "Mul"
      input_arg {
        name: "x"
        type_attr: "T"
      }
      input_arg {
        name: "y"
        type_attr: "T"
      }
      output_arg {
        name: "z"
        type_attr: "T"
      }
      attr {
        name: "T"
        type: "type"
        allowed_values {
          list {
            type: DT_HALF
            type: DT_FLOAT
            type: DT_DOUBLE
            type: DT_UINT8
            type: DT_INT8
            type: DT_UINT16
            type: DT_INT16
            type: DT_INT32
            type: DT_INT64
            type: DT_COMPLEX64
            type: DT_COMPLEX128
          }
        }
      }
      is_commutative: true
    }
    op {
      name: "Placeholder"
      output_arg {
        name: "output"
        type_attr: "dtype"
      }
      attr {
        name: "dtype"
        type: "type"
      }
      attr {
        name: "shape"
        type: "shape"
        default_value {
          shape {
          }
        }
      }
    }
  }
  tags: "serve"
  tensorflow_version: "1.1.0"
  tensorflow_git_version: "b\'unknown\'"
}
graph_def {
  node {
    name: "a"
    op: "Placeholder"
    attr {
      key: "_output_shapes"
      value {
        list {
          shape {
          }
        }
      }
    }
    attr {
      key: "dtype"
      value {
        type: DT_INT8
      }
    }
    attr {
      key: "shape"
      value {
        shape {
        }
      }
    }
  }
  node {
    name: "b"
    op: "Placeholder"
    attr {
      key: "_output_shapes"
      value {
        list {
          shape {
          }
        }
      }
    }
    attr {
      key: "dtype"
      value {
        type: DT_INT8
      }
    }
    attr {
      key: "shape"
      value {
        shape {
        }
      }
    }
  }
  node {
    name: "sum"
    op: "Add"
    input: "a"
    input: "b"
    attr {
      key: "T"
      value {
        type: DT_INT8
      }
    }
    attr {
      key: "_output_shapes"
      value {
        list {
          shape {
          }
        }
      }
    }
  }
  node {
    name: "mul"
    op: "Mul"
    input: "a"
    input: "b"
    attr {
      key: "T"
      value {
        type: DT_INT8
      }
    }
    attr {
      key: "_output_shapes"
      value {
        list {
          shape {
          }
        }
      }
    }
  }
  versions {
    producer: 21
  }
}
signature_def {
  key: "add"
  value {
    inputs {
      key: "a"
      value {
        name: "a:0"
        dtype: DT_INT8
        tensor_shape {
        }
      }
    }
    inputs {
      key: "b"
      value {
        name: "b:0"
        dtype: DT_INT8
        tensor_shape {
        }
      }
    }
    outputs {
      key: "sum"
      value {
        name: "sum:0"
        dtype: DT_INT8
        tensor_shape {
        }
      }
    }
    method_name: "add"
  }
}
signature_def {
  key: "mul"
  value {
    inputs {
      key: "a"
      value {
        name: "a:0"
        dtype: DT_INT8
        tensor_shape {
        }
      }
    }
    inputs {
      key: "b"
      value {
        name: "b:0"
        dtype: DT_INT8
        tensor_shape {
        }
      }
    }
    outputs {
      key: "mul"
      value {
        name: "mul:0"
        dtype: DT_INT8
        tensor_shape {
        }
      }
    }
    method_name: "mul"
  }
}
